{
  "periods": [
    {
      "id": "prehistoric_ancient",
      "name": "Праистория и ранна древност",
      "start_year": -2600,
      "end_year": -1200,
      "description": "Първите писмени текстове – погребални химни, заклинания и митове – свидетелстват, че смъртта е централен въпрос за човечеството още от зората на цивилизацията."
    },
    {
      "id": "classical_antiquity",
      "name": "Класическа античност",
      "start_year": -1200,
      "end_year": 500,
      "description": "Гръцко-римската култура развива героичния и философския поглед към смъртта чрез епоса и трагедията."
    },
    {
      "id": "middle_ages",
      "name": "Средновековие",
      "start_year": 500,
      "end_year": 1500,
      "description": "Християнската есхатология и мотивът danse macabre превръщат смъртта в морализаторски символ."
    },
    {
      "id": "renaissance",
      "name": "Ренесанс",
      "start_year": 1500,
      "end_year": 1700,
      "description": "Хуманизмът възражда античните идеи; трагедиите на Шекспир поставят личната и политическата смърт в центъра на сцената."
    },
    {
      "id": "romanticism",
      "name": "Романтизъм",
      "start_year": 1780,
      "end_year": 1850,
      "description": "Емоцията и индивидуалният блян превръщат смъртта в екзистенциална и любовна крайност."
    },
    {
      "id": "realism",
      "name": "Реализъм",
      "start_year": 1850,
      "end_year": 1914,
      "description": "Писатели като Толстой изследват смъртта в социален и морален контекст – войни, болести, кризи."
    },
    {
      "id": "modernism_world",
      "name": "Модернизъм (световен)",
      "start_year": 1914,
      "end_year": 1945,
      "description": "Двете световни войни раждат поезия на окопите и образа на цивилизационната смърт."
    },
    {
      "id": "postmodern",
      "name": "Постмодернизъм и съвременност",
      "start_year": 1945,
      "end_year": 2025,
      "description": "Фрагментирана памет за войната и иронично, често философско осмисляне на смъртта."
    },
    {
      "id": "revival",
      "name": "Българско възраждане",
      "start_year": 1762,
      "end_year": 1878,
      "description": "Период на национално пробуждане и борба за независимост."
    },
    {
      "id": "post_liberation",
      "name": "Следосвобожденска България",
      "start_year": 1878,
      "end_year": 1944,
      "description": "Изграждане на модерна държава и търсене на нови литературни изрази."
    },
    {
      "id": "modern",
      "name": "Модерна епоха (българска)",
      "start_year": 1944,
      "end_year": 2000,
      "description": "Социална ангажираност, философска и предметна лирика."
    }
  ],
  "authors": [
    {
      "id": "alekko_constantinov",
      "name": "Алеко Константинов",
      "birth_year": 1863,
      "death_year": 1897,
      "period_id": "modern",
      "bio": "Български писател, сатирик и общественик. Автор на 'Бай Ганьо', произведение, което разглежда социалните проблеми на България след Освобождението, чрез сатирично изобразяване на героя Бай Ганьо."
    },
    {
      "id": "ivan_vazov",
      "name": "Иван Вазов",
      "birth_year": 1850,
      "death_year": 1921,
      "period_id": "modern",
      "bio": "Български писател, поет и драматург. Създател на 'Под игото' и един от основните представители на българския реализъм. Неговото творчество често разглежда теми за национално самоопределение и борбата за свобода."
    },
    {
      "id": "pencho_slaveykov",
      "name": "Пенчо Славейков",
      "birth_year": 1866,
      "death_year": 1912,
      "period_id": "modern",
      "bio": "Един от водещите български поети и интелектуалци. Представител на българския символизъм. Автор на произведения като 'Неразделни', в които изразява теми за любовта, смъртта и вечността."
    },
    {
      "id": "dimitar_talev",
      "name": "Димитър Талев",
      "birth_year": 1898,
      "death_year": 1966,
      "period_id": "modern",
      "bio": "Български писател, автор на романите 'Железният светилник' и 'Преспанските камбани'. Творчеството му се свързва с теми за националната идентичност и социалните преобразования в България през Възраждането."
    },
    {
      "id": "dimitar_dimov",
      "name": "Димитър Димов",
      "birth_year": 1909,
      "death_year": 1966,
      "period_id": "modern",
      "bio": "Български писател, автор на романа 'Тютюн', който изобразява социалните и морални проблеми в България по време на социалистическата индустриализация."
    },
    {
      "id": "radichkov",
      "name": "Радичков",
      "birth_year": 1929,
      "death_year": 2004,
      "period_id": "modern",
      "bio": "Български писател и драматург, известен със своите театрални и литературни произведения, които разглеждат социалните и философските проблеми на България през социализма."
    },
    {
      "id": "elin_pelin",
      "name": "Елин Пелин",
      "birth_year": 1877,
      "death_year": 1949,
      "period_id": "modern",
      "bio": "Български писател и новелист, известен с произведенията си за живота на българското село и социалните проблеми на епохата. Неговото творчество често разглежда теми за човешката доброта и човешката слабост."
    },
    {
      "id": "hristo_botev",
      "name": "Христо Ботев",
      "birth_year": 1848,
      "death_year": 1876,
      "period_id": "modern",
      "bio": "Български революционер, поет и писател, известен със своето революционно и патриотично творчество. Неговата поезия разглежда теми за борбата за свобода и личната жертва."
    },
    {
      "id": "emiliyan_stanev",
      "name": "Емилиян Станев",
      "birth_year": 1907,
      "death_year": 2001,
      "period_id": "modern",
      "bio": "Български писател и романист, автор на произведението 'Крадецът на праскови', което разглежда темата за любовта и войната."
    },
    {
      "id": "nikolay_haitov",
      "name": "Николай Хайтов",
      "birth_year": 1928,
      "death_year": 2002,
      "period_id": "modern",
      "bio": "Български писател, известен със своите разкази за българското село и нравствените избори на хората в условията на социални и политически промени."
    },
    {
      "id": "ivan_vazov",
      "name": "Иван Вазов",
      "birth_year": 1850,
      "death_year": 1921,
      "period_id": "modern",
      "bio": "Български писател, поет и драматург. Създател на 'Под игото' и един от основните представители на българския реализъм. Неговото творчество често разглежда теми за национално самоопределение и борбата за свобода."
    }
  ],
  "themes": [
    {
      "id": "heroic",
      "name": "Героична смърт",
      "description": "Саможертва за висш идеал.",
      "color": [
        "#ff6b6b",
        "#c92a2a"
      ]
    },
    {
      "id": "romantic",
      "name": "Романтична смърт",
      "description": "Любов и трагична съдба.",
      "color": [
        "#da77f2",
        "#862e9c"
      ]
    },
    {
      "id": "spiritual",
      "name": "Философска смърт",
      "description": "Екзистенциални и метафизични размишления.",
      "color": [
        "#4dabf7",
        "#1864ab"
      ]
    },
    {
      "id": "social",
      "name": "Социална смърт",
      "description": "Последица от обществени конфликти.",
      "color": [
        "#69db7c",
        "#2b8a3e"
      ]
    },
    {
      "id": "natural",
      "name": "Природна смърт",
      "description": "Част от цикъла на битието.",
      "color": [
        "#ffd43b",
        "#e67700"
      ]
    },
    {
      "id": "satirical",
      "name": "Сатирична смърт",
      "description": "Сатирично представяне на живота и смъртта.",
      "color": [
        "#845ef7",
        "#5f3dc4"
      ]
    },
    {
      "id": "moral",
      "name": "Морална смърт",
      "description": "Разглеждане на съществуването и човешката същност.",
      "color": [
        "#6f42c1",
        "#9b59b6"
      ]
    },
    {
      "id": "human_death",
      "name": "Смърт на всичко човечно",
      "description": "Символизира крах на човечността и моралните устои.",
      "color": [
        "#6c757d",
        "#495057"
      ]
    }
  ],
  "works": [
    {
      "id": "bay_ganyo",
      "title": "Бай Ганьо",
      "author_id": "alekko_constantinov",
      "year": 1895,
      "period_id": "modern",
      "themes": [
        "satirical"
      ],
      "summary_minimal": "В 'Бай Ганьо' Алеко Константинов представя образа на Бай Ганьо – български търговец, който пътува из Европа. Той е необразован, груб и лицемерен, но същевременно предприемчив и самоуверен. Въпреки че не се замисля за смъртта, тя е част от неговото съществуване, отразявайки безразличието му към по-дълбоките въпроси на живота.",
      "summary_detailed": "Произведението е съставено от пътеписи и фейлетони, в които Бай Ганьо се сблъсква с различни социални и културни норми в Европа. Неговото поведение е израз на липса на самосъзнание и морална отговорност. Смъртта не е разглеждана като основна тема, но тя присъства като неизбежен аспект от живота, който Бай Ганьо не осъзнава или игнорира. Творбата служи като социална сатира, критикуваща моралната деградация и липсата на социална отговорност в обществото.",
      "context_historical": "България, края на 19-ти век – социални и политически промени в следосвобожденска България. Проблеми със социалната отговорност, моралните изкривявания и търсенето на нови идентичности в обществото.",
      "context_literary": "Константинов създава персонаж, който е подложен на критика заради съвременните за него социални недъзи и недостатъци. Бай Ганьо става типичен пример за характер в българската литература, който обединява сатиричните елементи с философската тематика за моралните отговорности на индивида.",
      "context_thematic": "Мотивът за смъртта не е основен, но е свързан с въпроси за социалната отговорност, моралните избори и тяхното отражение в личността на героя. \"Смъртта\" на Бай Ганьо е резултат от една живяна в егоизъм и морална неграмотност.",
      "animation_data": {
        "path": "spiral_origin",
        "duration": 3200
      },
      "resources": [
        {
          "title": "Wikipedia",
          "url": "https://bg.wikipedia.org/wiki/Бай_Ганьо"
        },
        {
          "title": "Encyclopaedia Britannica",
          "url": "https://www.britannica.com/biography/Aleko-Konstantinov"
        },
        {
          "title": "YouTube – Филм по Книгата'Бай Ганьо'",
          "url": "https://www.youtube.com/watch?v=QgwguUyCR_g"
        },
        {
          "title": "Уча.се – Образът на Бай Ганьо",
          "url": "https://ucha.se/watch/6018/obrazat-na-bay-ganyo-aleko-konstantinov"
        }
      ]
    },
    {
      "id": "under_the_yoke",
      "title": "Под игото",
      "author_id": "ivan_vazov",
      "year": 1894,
      "period_id": "modern",
      "themes": [
        "heroic",
        "death"
      ],
      "summary_minimal": "Романът 'Под игото' на Иван Вазов разказва за живота на българите в предвечерието на Освобождението. В него се разглеждат теми като саможертва, национално пробуждане и лична отговорност. Смъртта е представена като неизбежен елемент от борбата за свобода, символизираща както героизъм, така и трагедия.",
      "summary_detailed": "В 'Под игото' Вазов пресъздава живота на жителите на Бяла черква, техните надежди и страхове преди Aприлското въстание. Главният герой, Бойчо Огнянов, е революционен апостол, който вдъхновява местните да се включат в борбата за свобода. Смъртта е неизбежен аспект от този процес – тя е както героична, така и трагична. Жертвите на въстанието показват различни аспекти на смъртта – от саможертвата до личната трагедия. Вазов използва тези образи, за да подчертае цената на свободата и моралните дилеми, пред които са изправени героите.",
      "context_historical": "Романът 'Под игото' се развива в края на 19-ти век, по време на османското владичество над България, непосредствено преди Априлското въстание от 1876 г. Това е период на нарастващо национално съзнание и подготовка за освобождение. Българският народ е изпълнен с желание за свобода, но същевременно изпитва страх и несигурност относно бъдещето. Въстанието, въпреки че не успява, играе ключова роля в пробуждането на националния дух и в подготовката за последвалото Освобождение през 1878 г.",
      "context_literary": "Романът 'Под игото' е класически пример за българския реализъм, изразяващ социалната и политическата действителност по време на Освобождението. Вазов съчетава историческите събития с личните съдби на героите, като представя националните идеали и страдания.",
      "context_thematic": "Смъртта в 'Под игото' е основна тема, която разглежда не само физическата гибел на героите, но и тяхната духовна жертва за свободата. Вазов показва как смъртта на революционерите е не само трагедия, но и героизъм, символизиращ крайната цел – освобождението на България.",
      "animation_data": {
        "path": "spiral_origin",
        "duration": 3200
      },
      "resources": [
        {
          "title": "Wikipedia",
          "url": "https://bg.wikipedia.org/wiki/Под_игото"
        },
        {
          "title": "Уча.се – Анализ на романа 'Под игото'",
          "url": "https://ucha.se/watch/5671/analiz-na-romana-pod-igoto-chast-3-ivan-vazov"
        },
        {
          "title": "Уча.се – Главата 'Представлението' от романа 'Под игото'",
          "url": "https://ucha.se/watch/4761/predstavlenieto-pod-igoto-geroi-kompozitsiya-i-temi-ivan-vazov"
        },
        {
          "title": "Под игото (1952) – Български игрален филм",
          "url": "https://www.youtube.com/watch?v=nLteaWFC7Zw"
        },
        {
          "title": "Под игото (1990) – филм",
          "url": "https://www.youtube.com/watch?v=27I8-ls2p-g"
        }
      ]
    },
    {
      "id": "zhelezniyat_svetilnik",
      "title": "Железният светилник",
      "author_id": "dimitar_talev",
      "year": 1952,
      "period_id": "modern",
      "themes": [
        "human_death",
        "tragic"
      ],
      "summary_minimal": "„Железният светилник“ на Димитър Талев проследява съдбите на българите в Преспа по време на Възраждането. Романът разкрива как обществените норми и родовият морал потискат човешките чувства, водейки до трагедии. Смъртта е показана като символ на невъзможността да се съхрани човечността в условията на дълг, чест и традиция.",
      "summary_detailed": "В „Железният светилник“ Димитър Талев изобразява трагичния сблъсък между личността и традиционните обществени норми. Герои като Катерина и Божана стават жертви на обществено наложени роли и родови очаквания. Смъртта не е героична, а дълбоко трагична – резултат от невъзможността да се живее свободно и човечно. Катерина е ликвидирана от собствената си майка в името на честта, а Божана не намира своето място в новия свят. Романът показва как обществото може да потисне човешката душа до степен на пълна вътрешна разруха, като смъртта се превръща в символ на изгубената човечност и цената на историческия преход.",
      "context_historical": "Преспа по време на Българското възраждане, когато борбата за национално освобождение се преплита с вътрешни родови и социални конфликти. Герои като Лазар Глаушев въплъщават новия обществен ред, но плащат висока цена – загубата на човешка близост.",
      "context_literary": "Реализмът в романа е преплетен с трагичен символизъм. Смъртта не е идеализирана, а служи за морална и социална критика. Талев използва образа на Султана като носител на разрушителния патриархат, а Катерина – като жертва на отказаната човечност. Романът надхвърля историческото си време и разглежда универсални теми за морала, свободата и човешката цена на реда.",
      "context_thematic": "Смъртта в „Железният светилник“ символизира преди всичко загубата на човешкото лице на обществото. Примери като убийството на Катерина, самотата на Божана и крахът на Султана показват как традицията убива съпротивата на човешката душа. Трагизмът доминира над героизма – жертвата не води до слава, а до вътрешна разруха.",
      "animation_data": {
        "path": "spiral_origin",
        "duration": 3200
      },
      "resources": [
        {
          "title": "Аудиокнига – Димитър Талев, 'Железният светилник' (първа част)",
          "url": "https://www.youtube.com/watch?v=BpPItFBzHLw"
        },
        {
          "title": "Аудиокнига – Димитър Талев, 'Железният светилник' (втора част)",
          "url": "https://www.youtube.com/watch?v=wUpip31yfkA"
        },
        {
          "title": "Аудиокнига – Димитър Талев, 'Железният светилник' (пълна версия)",
          "url": "https://www.youtube.com/playlist?list=PLHbqT20VI3oQNsySgFj4O9Nk73aoecuP5"
        },
        {
          "title": "Документален филм – 'Железният светилник' по БНТ",
          "url": "https://www.youtube.com/watch?v=RJpImcj8uBo"
        },
        {
          "title": "Уча.се – Времето в романа 'Железният светилник'",
          "url": "https://ucha.se/watch/9998/vremeto-v-romana-zhelezniat-svetilnik-dimitar-talev"
        }
      ]
    },
    {
      "id": "darvo_bez_koren",
      "title": "Дърво без корен",
      "author_id": "nikolay_haitov",
      "year": 1967,
      "period_id": "modern",
      "themes": [
        "social",
        "death"
      ],
      "summary_minimal": "В разказа 'Дърво без корен' Николай Хайтов представя историята на възрастен мъж, който след смъртта на съпругата си е принуден да живее при сина си в града. Отчужден от новата среда, той се чувства като 'дърво без корен'. Смъртта в разказа е символ на отчуждението и липсата на смисъл в модерния живот.",
      "summary_detailed": "Героят на разказа, Гатьо, е старец, който след смъртта на съпругата си е принуден да живее при сина си в града. Въпреки материалното благополучие, той се чувства самотен и изолиран. Липсата на истински човешки взаимоотношения го кара да се чувства като 'дърво без корен'. Смъртта в разказа не е само физическа, а и духовна — тя е символ на отчуждението и липсата на смисъл в съвременния живот. Гатьо решава да се върне на село, където се чувства жив и свързан със своите корени.",
      "context_historical": "България, 60-те години на 20-ти век — период на социални и икономически промени, когато традиционният начин на живот започва да се заменя с урбанизация и модернизация.",
      "context_literary": "Николай Хайтов е известен със своите произведения, които разглеждат теми като човешката душа, природата и социалните промени. 'Дърво без корен' е част от сборника 'Диви разкази', в който авторът изследва конфликта между традиционните и модерните ценности.",
      "context_thematic": "Основната тема на разказа е отчуждението на човека в съвременното общество. Смъртта тук е не само физическа, но и духовна — тя символизира загубата на човешки взаимоотношения и смисъл в живота.",
      "animation_data": {
        "path": "spiral_origin",
        "duration": 3200
      },
      "resources": [
        {
          "title": "Wikipedia – Дърво без корен",
          "url": "https://bg.wikipedia.org/wiki/Дърво_без_корен"
        },
        {
          "title": "Аудиокнига – Николай Хайтов, 'Дърво без корен' (изп. Богдан Дуков)",
          "url": "https://www.youtube.com/watch?v=TEy5xYOmTFs"
        },
        {
          "title": "Филм – 'Дърво без корен' (1974) – Български игрален филм",
          "url": "https://www.youtube.com/watch?v=fMaRhlpIIvA"
        }
      ]
    },
    {
      "id": "hadji_dimitur",
      "title": "Хаджи Димитър",
      "author_id": "hristo_botev",
      "year": 1868,
      "period_id": "modern",
      "themes": [
        "heroic",
        "death"
      ],
      "summary_minimal": "В баладата 'Хаджи Димитър' Христо Ботев представя образа на българския революционер, който умира героично в битка. Смъртта му не е краят, а преход към безсмъртие в народната памет. Творбата изразява възхищение към саможертвата и героизма, като поставя акцент върху духовното безсмъртие, което остават след себе си.",
      "summary_detailed": "Баладата започва с категоричното твърдение 'Жив е той, жив е!', което подчертава, че смъртта на героя не е краят, а преход към вечност. Хаджи Димитър лежи на Балкана, смъртно ранен, но неговата смърт не е трагична, а възвишена. Природата и народът скърбят за него, като го възприемат като герой, чието дело ще живее вечно. Творбата изразява идеята, че смъртта за свобода е път към безсмъртие, а не край.",
      "context_historical": "България, 19-ти век – време на национално освобождение и борба срещу османското робство. Хаджи Димитър е историческа личност, участник в хайдушкото движение.",
      "context_literary": "Христо Ботев съчетава романтизма с патриотичния дух, представяйки смъртта като героичен акт, който води към безсмъртие. Баладата е част от българската революционна поезия.",
      "context_thematic": "Мотивът за смъртта е разглеждан като преход към вечност, като израз на саможертва за по-висша кауза. Смъртта не е трагична, а възвишена и героична.",
      "animation_data": {
        "path": "spiral_origin",
        "duration": 3200
      },
      "resources": [
        {
          "title": "Wikipedia – Хаджи Димитър (балада)",
          "url": "https://bg.wikipedia.org/wiki/Хаджи_Димитър_(балада)"
        },
        {
          "title": "Аудиокнига – Христо Ботев: Хаджи Димитър",
          "url": "https://open.spotify.com/track/6QsISSlkmFkzgshBw0O59I"
        },
        {
          "title": "Анализ на поемата „Хаджи Димитър“ – domashno.bg",
          "url": "https://domashno.bg/m/analiz-na-poemata-xadzi-dimitier"
        },
        {
          "title": "Анализ на „Хаджи Димитър“ – zamatura.eu",
          "url": "https://zamatura.eu/12klas/maturi-12klas/predmeti/bel/proizvedenia/hadji-dimitar/analiz-hadji-dimitar/"
        },
        {
          "title": "Видео урок: Анализ на стихотворението 'Хаджи Димитър' – Уча.се",
          "url": "https://ucha.se/watch/8078/polezen-analiz-na-stihotvorenieto-hadzhi-dimitar-hristo-botev"
        }
      ]
    },
    {
      "id": "tutun",
      "title": "Тютюн",
      "author_id": "dimitar_dimov",
      "year": 1951,
      "period_id": "modern",
      "themes": [
        "moral",
        "death"
      ],
      "summary_minimal": "Романът 'Тютюн' на Димитър Димов разглежда живота на българите през 30-те години на ХХ век, съсредоточавайки се върху социалните конфликти. Смъртта е представена като неизбежен край на моралната деградация и духовната пустота на героите.",
      "summary_detailed": "В 'Тютюн' Димов проследява съдбите на героите, свързани с тютюневата индустрия, и тяхната борба за власт, пари и признание. Главният герой, Борис, започва като беден младеж и се издига до ръководител на тютюнев концерн. Въпреки успеха си, той губи човечността си, като използва хората около себе си за лична изгода. Смъртта на неговата съпруга, Мария, е резултат от неговото безчовечие и алчност. Той се поддава на властта и парите, което води до неговата собствена гибел.",
      "context_historical": "България, 30-те години на ХХ век – време на социални и икономически промени, когато тютюневата индустрия играе ключова роля в икономиката на страната.",
      "context_literary": "Романът е част от българската литература, отразяваща социалните и морални проблеми на времето, като се фокусира върху личните трагедии, произтичащи от социалната структура и икономическите интереси.",
      "context_thematic": "Смъртта в романа е духовна. Тя символизира края на моралните устои на героите и тяхната деградация в преследване на материални цели.",
      "animation_data": {
        "path": "spiral_decay",
        "duration": 3500
      },
      "resources": [
        {
          "title": "Wikipedia – Тютюн",
          "url": "https://bg.wikipedia.org/wiki/Тютюн_(роман)"
        },
        {
          "title": "Уча.се – Анализ на романа 'Тютюн'",
          "url": "https://ucha.se/watch/5812/analiz-na-romana-tyutyun-dimitar-dimov"
        },
        {
          "title": "Анализ на 'Тютюн' от Димитър Димов",
          "url": "https://domashno.bg/m/analiz-na-romaniet-tiutiun-ot-dimitier-dimov"
        },
        {
          "title": "Тютюн от Димитър Димов – ревю",
          "url": "https://knijovnost.wordpress.com/2023/12/10/тютюн-от-димитър-димов-ревю/"
        }
      ]
    },
    {
      "id": "geratsite",
      "title": "Гераците",
      "author_id": "elin_pelin",
      "year": 1911,
      "period_id": "modern",
      "themes": [
        "spiritual",
        "death"
      ],
      "summary_minimal": "В повестта 'Гераците' Елин Пелин проследява разпадането на патриархалния род на Гераците след смъртта на баба Марга. Тя е душата на семейството, а нейното отсъствие води до морална деградация и отчуждение между членовете на семейството.",
      "summary_detailed": "Повестта започва с идилична картина на семейната хармония, която бързо се разрушава след смъртта на баба Марга. Тя е символ на любовта, разбирателството и духовната сила на рода. След нейната смърт, отношенията между членовете на семейството се влошават. Синовете Божан, Петър и Павел се отдават на егоизъм, алчност и безотговорност, което води до разпад на семейната задруга. Символът на бора, посаден от прадедите, също е отсечен, което олицетворява края на патриархалния ред и началото на нова ера, изпълнена с конфликти и отчуждение.",
      "context_historical": "България, началото на 20-ти век – време на социални и икономически промени, когато традиционните патриархални структури започват да се разпадат под натиска на модернизацията и урбанизацията.",
      "context_literary": "Повестта е част от българската литература, която се стреми да отрази социалните и морални проблеми на времето, като се фокусира върху личните трагедии, произтичащи от социалната структура и икономическите интереси.",
      "context_thematic": "Смъртта в повестта не е само физическа, а и духовна. Тя символизира края на моралните устои на героите и тяхната деградация в преследване на материални цели.",
      "animation_data": {
        "path": "spiral_decay",
        "duration": 3500
      },
      "resources": [
        {
          "title": "Wikipedia – Гераците",
          "url": "https://bg.wikipedia.org/wiki/Гераците"
        },
        {
          "title": "Анализ на трагичната история в повестта 'Гераците'",
          "url": "https://domashno.bg/m/analiz-na-tragicnata-istoriia-na-povestta-geracite"
        },
        {
          "title": "Елин Пелин — Гераците (8) - Моята библиотека",
          "url": "https://chitanka.info/text/5624/8"
        },
        {
          "title": "Елин Пелин — Гераците (1) - Моята библиотека",
          "url": "https://chitanka.info/text/5624"
        }
      ]
    },
    {
      "id": "kradetsat_na_praskovi",
      "title": "Крадецът на праскови",
      "author_id": "emiliyan_stanev",
      "year": 1948,
      "period_id": "modern",
      "themes": [
        "spiritual",
        "death"
      ],
      "summary_minimal": "В повестта 'Крадецът на праскови' на Емилиян Станев, смъртта е неизбежен елемент, който подчертава крехкостта на човешкото съществуване. В условията на война, героите се изправят пред екзистенциални въпроси за живота и смъртта, като техните избори и съдби са неразривно свързани с тях.",
      "summary_detailed": "Повестта проследява историята на военнопленник, Иво Обретенович, който по време на Първата световна война се влюбва в Елисавета, съпруга на българския полковник Михаил. Тяхната любов разцъфтява в условията на война и страдание, но е обречена на трагичен край. Иво е застрелян, а Елисавета, не можейки да понесе загубата, се самоубива. Смъртта в повестта не е само физическа, а и духовна — тя символизира края на една невъзможна любов.",
      "context_historical": "България, Първата световна война — време на социални и политически промени, когато войната разрушава човешки животи и морални устои.",
      "context_literary": "Повестта е част от българската литература, която се стреми да отрази социалните и морални проблеми на времето, като се фокусира върху личните трагедии, произтичащи от социалната структура и икономическите интереси.",
      "context_thematic": "Мотивът за смъртта е водещ в повестта и присъства както в нейния сюжетен край, така и като постоянно усещане за обреченост. Смъртта е не само физическа, но и духовна — тя бележи загубата на вяра, човечност и възможност за щастие. Любовта между Иво и Елисавета се оказва невъзможна в един свят, пропит от отчуждение. Смъртта става единственият изход от моралната безизходица, в която се намират героите.",
      "animation_data": {
        "path": "spiral_decay",
        "duration": 3500
      },
      "resources": [
        {
          "title": "Wikipedia – Крадецът на праскови",
          "url": "https://bg.wikipedia.org/wiki/Крадецът_на_праскови"
        },
        {
          "title": "Storytel – Аудиокнига",
          "url": "https://www.storytel.com/bg/books/424727"
        },
        {
          "title": "YouTube – Аудио книга (гл. 1)",
          "url": "https://www.youtube.com/watch?v=oj5ehXBhOZM"
        },
        {
          "title": "YouTube – Аудио книга (гл. 2)",
          "url": "https://www.youtube.com/watch?v=DME7s8gdR5s"
        },
        {
          "title": "Уча.се – Творческа история и сюжет",
          "url": "https://ucha.se/watch/12648/tvorcheska-istoria-syuzhet-i-kompozitsia-na-povestta--kradetsat-na-praskovi--emilian-stanev"
        }
      ]
    },
    {
      "id": "novoto_grobishte_nad_slivnitsa",
      "title": "Новото гробище над Сливница",
      "author_id": "ivan_vazov",
      "year": 1885,
      "period_id": "modern",
      "themes": [
        "heroic",
        "death"
      ],
      "summary_minimal": "В стихотворението 'Новото гробище над Сливница' Иван Вазов възпява героизма на българските войници, загинали в Сръбско-българската война от 1885 г. Смъртта им е представена не като трагедия, а като саможертва за родината, издигаща ги в духовната сфера на безсмъртието.",
      "summary_detailed": "Стихотворението започва с обръщение към загиналите войници, които 'в друг полк минаха', символизирайки прехода от живота към вечността. Смъртта не е представена като трагична, а като 'лека нощ', което подчертава спокойствието и примирението на героите. Вазов акцентира върху мотивите за саможертва и родолюбие, като подчертава, че войниците не са паднали за 'трон злат' или 'някой кумир', а за родината. В последните строфи се изразява болката от забравата на героите, които 'спят в тез полета', но тяхната памет ще бъде съхранена в песента и славата.",
      "context_historical": "Стихотворението е написано след Сръбско-българската война от 1885 г., когато България успешно защитава Съединението си с Източна Румелия. Войната е кратка, но тежка, и води до значителни човешки жертви.",
      "context_literary": "Част от стихосбирката 'Сливница', произведението е пример за патриотична поезия, възпяваща героизма и саможертвата на българските войници.",
      "context_thematic": "Мотивът за смъртта е представен като саможертва за родината, издигаща героите в духовната сфера на безсмъртието.",
      "animation_data": {
        "path": "spiral_heroic",
        "duration": 3000
      },
      "resources": [
        {
          "title": "Wikipedia",
          "url": "https://bg.wikipedia.org/wiki/Новото_гробище_над_Сливница"
        },
        {
          "title": "Анализ на стихотворението 'Новото гробище над Сливница'",
          "url": "https://domashno.bg/m/analiz-na-stixotvorenieto-novoto-grobishhe-nad-slivnica"
        },
        {
          "title": "Анимация на стихотворението 'Новото гробище над Сливница'",
          "url": "https://www.uspelite.bg/novoto-grobishte-nad-slivnitsa-na-vazov-ojivyava-v-kratak-animatsionen-film-1"
        },
        {
          "title": "Текст на стихотворението 'Новото гробище над Сливница'",
          "url": "https://domashno.bg/tvorba/novoto-grobishhe-nad-slivnica/text"
        }
      ]
    },
    {
      "id": "do_moeto_parvo_libe",
      "title": "До моето първо либе",
      "author_id": "hristo_botev",
      "year": 1871,
      "period_id": "modern",
      "themes": [
        "romantic",
        "death"
      ],
      "summary_minimal": "В стихотворението 'До моето първо либе' Христо Ботев се обръща към любимата си, заявявайки, че не може да изживее личното си щастие, докато народът му страда. Той я призовава да съпреживее болката на народа и да се приобщи към борбата за свобода, като подчертава, че смъртта в името на идеала е достойна и желана.",
      "summary_detailed": "Стихотворението започва с призив към любимата да не му влага в сърцето отрова, т.е. да не го задържа в света на личната любов, докато народът му страда. Лирическият герой изразява готовността си да се отдаде на борбата за свобода, като поставя националния дълг над личните чувства. Смъртта в този контекст не е трагедия, а саможертва за висша цел. Той я призовава да запее песен за страданията на народа, за да се присъедини към него в борбата. Образът на смъртта е представен като мила усмивка и сладка почивка, символизираща края на робството и началото на свободата.",
      "context_historical": "България, 1871 г. – време на усилена революционна дейност и подготовка за национално освобождение.",
      "context_literary": "Част от Ботевата поезия, която се характеризира с патриотичен и революционен дух, изразяващ се в готовността за саможертва в името на свободата.",
      "context_thematic": "Мотивът за смъртта е представен като необходима и достойна част от борбата за освобождение, като средство за постигане на национална и лична свобода.",
      "animation_data": {
        "path": "spiral_heroic",
        "duration": 3000
      },
      "resources": [
        {
          "title": "Wikipedia",
          "url": "https://bg.wikipedia.org/wiki/Новото_гробище_над_Сливница"
        },
        {
          "title": "Анализ на стихотворението 'Новото гробище над Сливница'",
          "url": "https://domashno.bg/m/analiz-na-stixotvorenieto-novoto-grobishhe-nad-slivnica"
        },
        {
          "title": "Анимация на стихотворението 'Новото гробище над Сливница'",
          "url": "https://www.uspelite.bg/novoto-grobishte-nad-slivnitsa-na-vazov-ojivyava-v-kratak-animatsionen-film-1"
        },
        {
          "title": "Текст на стихотворението 'Новото гробище над Сливница'",
          "url": "https://domashno.bg/tvorba/novoto-grobishhe-nad-slivnica/text"
        }
      ]
    },
    {
      "id": "nerazdelni",
      "title": "Неразделни",
      "author_id": "pencho_slaveykov",
      "year": 1895,
      "period_id": "modern",
      "themes": [
        "romantic",
        "death"
      ],
      "summary_minimal": "В баладата 'Неразделни' Пенчо Славейков представя трагичната любовна история на двама млади, които поради родови забрани предпочитат смъртта пред живота без любимия. Техните души се сливат в природата, доказвайки, че истинската любов е вечна и неразделна.",
      "summary_detailed": "Стихотворението започва с образа на Калина и Явор, чиито клони се преплитат, символизирайки тяхната любов. Калина разказва за тяхната невъзможна любов, предизвикана от родовите забрани. След смъртта им, техните души се сливат в дървета, доказвайки, че любовта им е вечна и неразделна.",
      "context_historical": "1895 г. – време на социални и културни промени в България, когато се утвърдяват нови идеи за личната свобода и правото на избор.",
      "context_literary": "Част от българската символистична поезия, баладата изразява теми за любовта, смъртта и вечността.",
      "context_thematic": "Смъртта в баладата е представена като последен акт на любовта, който води до вечна и неразделна връзка между влюбените.",
      "animation_data": {
        "path": "spiral_romantic",
        "duration": 3000
      },
      "resources": [
        {
          "title": "Wikipedia",
          "url": "https://bg.wikipedia.org/wiki/Неразделни"
        },
        {
          "title": "Текст на стихотворението 'Неразделни'",
          "url": "https://domashno.bg/tvorba/nerazdelni/text"
        }
      ]
    }
  ],
  "connections": [
    {
      "id": "bay_ganyo_heroic_archetype",
      "from_work_id": "bay_ganyo",
      "to_work_id": "hadji_dimitur",
      "conn_type": "heroic_archetype",
      "description": "От митичния герой към класическия воин"
    },
    {
      "id": "bay_ganyo_heroic_archetype",
      "from_work_id": "bay_ganyo",
      "to_work_id": "do_moeto_parvo_libe",
      "conn_type": "heroic_archetype",
      "description": "От личната борба към националния идеал"
    },
    {
      "id": "kradetsat_na_praskovi_death",
      "from_work_id": "kradetsat_na_praskovi",
      "to_work_id": "tutun",
      "conn_type": "death",
      "description": "От загубената любов към моралната деградация"
    },
    {
      "id": "geratsite_death",
      "from_work_id": "geratsite",
      "to_work_id": "zhelezniyat_svetilnik",
      "conn_type": "death",
      "description": "От семейната трагедия към революционната саможертва"
    },
    {
      "id": "hadji_dimitur_death",
      "from_work_id": "hadji_dimitur",
      "to_work_id": "novoto_grobishte_nad_slivnitsa",
      "conn_type": "death",
      "description": "От героизма в борбата за свобода към вечността на паметта"
    },
    {
      "id": "tutun_death",
      "from_work_id": "tutun",
      "to_work_id": "kradetsat_na_praskovi",
      "conn_type": "death",
      "description": "От моралната деградация към вътрешната загуба"
    },
    {
      "id": "zhelezniyat_svetilnik_death",
      "from_work_id": "zhelezniyat_svetilnik",
      "to_work_id": "novoto_grobishte_nad_slivnitsa",
      "conn_type": "death",
      "description": "От саможертвата за свобода към героичната памет"
    },
    {
      "id": "do_moeto_parvo_libe_romantic_death",
      "from_work_id": "do_moeto_parvo_libe",
      "to_work_id": "nerazdelni",
      "conn_type": "romantic",
      "description": "От личната любов към вечността на неразделната любов"
    },
    {
      "id": "nerazdelni_romantic_death",
      "from_work_id": "nerazdelni",
      "to_work_id": "hadji_dimitur",
      "conn_type": "romantic",
      "description": "От трагичната любов към героична саможертва"
    }
  ]
}